it-service/ssl/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаОтменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

it-service/ssl/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ITСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITСервисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

it-service/ssl/CommonModules/ОбработкаОтменыПроведения/Ext/Module.bsl
Процедура ОтменаОплатыОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	 // Проверяем, что источник — это документ "Оплата"
    Если Источник.Ссылка = Источник.Ссылка Тогда
        // Получаем связанные заказы, чтобы изменить их статус на "НеОплачен"
        ЗаказыПокупателей = Документы.ЗаказКлиента.Выбрать();
        Пока ЗаказыПокупателей.Следующий() Цикл
            Если ЗаказыПокупателей.Ссылка = Источник.Заказ Тогда
                ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();
                // Меняем статус на "НеОплачен"
                ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.ОплатаОтменена;
                ЗакПокРек.Записать();
            КонецЕсли;
        КонецЦикла;
	КонецЕсли;
КонецПроцедуры   

Процедура ОтменаОтправкиОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	 // Проверяем, что источник — это документ "Оплата"
    Если Источник.Ссылка = Источник.Ссылка Тогда
        // Получаем связанные заказы, чтобы изменить их статус на "НеОплачен"
        ЗаказыПокупателей = Документы.ЗаказКлиента.Выбрать();
        Пока ЗаказыПокупателей.Следующий() Цикл
            Если ЗаказыПокупателей.Ссылка = Источник.Заказ Тогда
                ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();
                // Меняем статус на "НеОплачен"
                ЗакПокРек.СтатусЗаказа = Перечисления.СтатусыЗаказов.ДоставкаОтменена; 
				ЗакПокРек.ДатаВыдачи = Неопределено;
                ЗакПокРек.Записать();
            КонецЕсли;
        КонецЦикла;
	КонецЕсли;
КонецПроцедуры
